{
    "XXX01000":"Station not found. This substation is not present in production layout",
    "XXX02000":"Running Order not found. Please check the order is running or not in Order Management App",
    "XXX02001":"Order Product not found. Please check Product information configured properly or not",
    "XXX02002":"Order Roadmap not found.  Please check Roadmap information configured properly or not",
    "XXX02003":"Bom Details for component not found. Please check bomdetails bom record not found for the bomid",
    "XXX02004":"Bom Details for Qaulity Status not found. Please check bomdetails bom record not found for the bomid ",
    "XXX02005":"TargetSubStation not match with roadmap details.",
    "XXX02006":"TargetSubStation not match with rework roadmap details.",
    "XXX03000":"CheckInResult – 6 ( i.e. BYPASS). Please check roadmap type for Init substation.",
    "XXX03001":"CheckInResult – 6 ( i.e. BYPASS). Please check roadmap type for Normal/Final substation.",
    "XXX03002":"CheckInResult – -1 (i.e. Error). This mainid is not processed in previous substation and record not found in ShopWorx.",
    "XXX03003":"CheckInResult – 9 (i.e. DIFFERNTORDER). This order is not match with last processed record for mainid",
    "XXX03004":"CheckInResult – 2 (i.e.NG) This product is Bad in last substation.",
    "XXX03005":"CheckInResult – 7 (i.e. COMPLETED). This product is already completed.",
    "XXX03006":"CheckInResult – 11 (i.e. TESTFAILED) Testfailed for this product in last substation.",
    "XXX03007":"CheckInResult – 1 (i.e. OK) This product can be produced in this substation.",
    "XXX03010":"CheckInResult – 6 (i.e. BYPASS). Please check the roadmap details, Roadmap not found in running order.",
    "XXX03011":"CheckInResult – 6 (i.e. BYPASS). No previous substation found in roadmap details.",
    "XXX03012":"CheckInResult – 6 (i.e. BYPASS). This mainid is not processed in previous substation.",
    "XXX03013":"CheckInResult – -1 (i.e. ERROR) We received wrong result in previous substation.",
    "XXX03014":"CheckInResult – -1 (i.e. ERROR) MainID missing in PLC data.",
    "XXX03015":"CheckInResult – -1 (i.e. ERROR) CarrierID missing in PLC data.",
    "XXX03016":"CheckInResult – 8 (i.e. ORDERNOK). The order is not running in Order Management App.",
    "XXX03017":"CheckInResult – 4 (i.e. TYPENOK) Product Type Name not matched.",
    "XXX03018":"CheckInResult – 10 (i.e. TARGETCOUNTREACHED) Order is already finished and Order actual count is reached to Order target count",
    "XXX03019":"CheckInResult – 6 (i.e. BYPASS). Order is running but we can’t find roadmap in roadmap details.",
    "XXX03020":"CheckInResult – 3 (i.e. RECIPENOK) .PLC Recipe Name is not matched with Order Recipe Name.",
    "XXX03021":"CheckInResult – -1 ( i.e. SAVEDATAERROR). Error in writing Checkin result in ShopWorx.",
    "XXX03022":"CheckInResult – -1 ( i.e. SAVEDATAERROR).  Exception in writing Checkin result in ShopWorx.",
    "XXX03023":"Error in write value of CheckinResult to PLC after max retry",
    "XXX03024":"Error in write value of Target Substation to PLC after max retry",
    "XXX03025":"Error in write value of Target Substation to PLC after max retry",
    "XXX03026":"Error in write value of CheckInNGCode to PLC after max retry",
    "XXX03027":"Error in write value of CheckInProcessCode to PLC after max retry",
    "XXX03028": "Error in write value of CheckInComplet to PLC after max retry",
    "XXX03029": "Error in reset value of CHeckinCompleted to PLC after max retry",
    "XXX03030":"CheckInResult – 12 (i.e.CURRENTSTATIONNG) This product is Bad in last substation.",
    "XXX04000":"CheckComponentResult – -1 (i.e. ERROR) No Component found in PLC data for componenname.",
    "XXX04001":"CheckComponentResult – 2 (i.e. NG) Component quality is NG",
    "XXX04002":"CheckComponentResult – 4 (i.e. REWORK)  Component Quality is REWORK",
    "XXX04003":"CheckComponentResult – 1 (i.e. OK) Component Quality is OK",
    "XXX04004":"CheckComponentResult – 3 (i.e. SCRAP) Component Quality is SCRAP",
    "XXX04005":"CheckComponentResult – -1 (i.e. ERROR). Configuration problem. Please check bomdetails for component check status.",
    "XXX04006":"CheckComponentResult – -1 (i.e. ERROR). Componentid is not saved in previous substation in shopworx.",
    "XXX05000":"CheckoutResult – 2 (i.e. MISSINGDATA) MainID is missing in PLC data.",
    "XXX05001":"CheckOutResult – 2 (i.e. MISSINGDATA) CarrierID is missing in PLC data.",
    "XXX05002":"CheckOutResult – -1 (i.e. ERROR) MainId is not proccessed in previous substation.",
    "XXX05003":"CheckOutResult – -1 (i.e. ERROR) For quality status no record found in component for componentid.",
    "XXX05004":"Can not set or write targetsubstation to PLC in checkout. Please check roadmap details.",
    "XXX05005":"CheckOutResult – 2 (i.e. SAVEDATAERROR) Error in update mainid and ordername in ShopWorx for partstatus.",
    "XXX05006":"CheckOutResult – 2 (i.e. SAVEDATAERROR) Exception in update mainid and ordername in partstatus",
    "XXX05007":"CheckOutResult – 2 (i.e. SAVEDATAERROR)  Error in write/update mainid and ordername in ShopWorx",
    "XXX05008": "CheckOutResult – -1 (i.e. ERROR) Error in writing checkout data in ShopWorx ",
    "XXX05009": "CheckOutResult – -1 (i.e. ERROR) Exeption in writing checkout data in ShopWorx ",
    "XXX05010": "Error in write value of CheckoutResult to PLC after max retry",
    "XXX05011": "Error in write value of Target Substation to PLC after max retry",
    "XXX05012": "Error in write value of CheckoutCompleted to PLC after max retry",
    "XXX05013": "Error in reset value of CheckoutCompleted to PLC after max retry ",
    "XXX05014": "Error in write/update ORDER COUNT in ShopWorx",
    "XXX05015": "Exception in write/update ORDER COUNT ",
    "XXX05016": "Error in writing rework data in ShopWorx",
    "XXX05017": "Exception in writing rework data in ShopWorx",
    "XXX05018": "CheckoutResult – 2 (i.e. MISSINGDATA) SubStationResult is 0 in PLC data.",
    "XXX01001": "Session Id expired. Authenticate Again",
    "XXX01002": "Exception in Authentication",
    "XXX01003": "Error in Authentication"
 }